# 函数

In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:123456@localhost:3306/world

## 字符串函数

<img src="./image/字符串函数.jpg" width="70%">

### 1. CONCAT 拼接

In [3]:
%%sql
SELECT
    CONCAT(Continent, ' & ', Name) name 
FROM
    country
LIMIT
    5;

 * mysql+mysqlconnector://root:***@localhost:3306/world
5 rows affected.

[('North America & Aruba',),
 ('Asia & Afghanistan',),
 ('Africa & Angola',),
 ('North America & Anguilla',),
 ('Europe & Albania',)]

### 2. 大小写转换

In [7]:
%%sql
SELECT
     Name, LOWER(Name) lowerName, UPPER(Name) upperName
FROM
    country
LIMIT
    2;

 * mysql+mysqlconnector://root:***@localhost:3306/world
2 rows affected.

[('Aruba', 'aruba', 'ARUBA'), ('Afghanistan', 'afghanistan', 'AFGHANISTAN')]

### 3. 左右填充

In [20]:
%%sql
SELECT
    Name, LPAD(Name, 20, '_') LPAD, RPAD(Name, 20, '_') RPAD, LPAD(Population, 10, 0) Population
FROM
    country
ORDER BY
    Population DESC
LIMIT
    5;

 * mysql+mysqlconnector://root:***@localhost:3306/world
5 rows affected.

[('China', '_______________China', 'China_______________', '1277558000'),
 ('India', '_______________India', 'India_______________', '1013662000'),
 ('United States', '_______United States', 'United States_______', '0278357000'),
 ('Indonesia', '___________Indonesia', 'Indonesia___________', '0212107000'),
 ('Brazil', '______________Brazil', 'Brazil______________', '0170115000')]

### 4. 字符切片

In [12]:
%%sql
SELECT
    Name, SUBSTRING(Name, 5, 2) subname
FROM
    country
LIMIT
    5;

 * mysql+mysqlconnector://root:***@localhost:3306/world
5 rows affected.

[('Aruba', 'a'),
 ('Afghanistan', 'an'),
 ('Angola', 'la'),
 ('Anguilla', 'il'),
 ('Albania', 'ni')]

## 数值函数

<img src="./image/数值函数.jpg" width="70%">

### 1. 向上向下取整、四舍五入

In [33]:
%%sql
SELECT
    Name, 
    Population, 
    Population/10000000 '人口(千万)', 
    CEIL(Population/10000000) 向上取整, 
    FLOOR(Population/10000000) 向下取整,
    ROUND(Population/10000000, 2) 四舍五入,
    FLOOR(Population/100000000) '人口(亿)',
    MOD(FLOOR(Population/100000000), 2) '人口(亿位奇偶)' 
FROM
    country
ORDER BY
    Population DESC
LIMIT
    10;

 * mysql+mysqlconnector://root:***@localhost:3306/world
10 rows affected.

[('China', 1277558000, Decimal('127.7558'), 128, 127, Decimal('127.76'), 12, 0),
 ('India', 1013662000, Decimal('101.3662'), 102, 101, Decimal('101.37'), 10, 0),
 ('United States', 278357000, Decimal('27.8357'), 28, 27, Decimal('27.84'), 2, 0),
 ('Indonesia', 212107000, Decimal('21.2107'), 22, 21, Decimal('21.21'), 2, 0),
 ('Brazil', 170115000, Decimal('17.0115'), 18, 17, Decimal('17.01'), 1, 1),
 ('Pakistan', 156483000, Decimal('15.6483'), 16, 15, Decimal('15.65'), 1, 1),
 ('Russian Federation', 146934000, Decimal('14.6934'), 15, 14, Decimal('14.69'), 1, 1),
 ('Bangladesh', 129155000, Decimal('12.9155'), 13, 12, Decimal('12.92'), 1, 1),
 ('Japan', 126714000, Decimal('12.6714'), 13, 12, Decimal('12.67'), 1, 1),
 ('Nigeria', 111506000, Decimal('11.1506'), 12, 11, Decimal('11.15'), 1, 1)]

### 2. 随机数

In [63]:
%%sql
-- 六位随机验证码
SELECT 
    LPAD(ROUND(RAND() * 1000000, 0), 6, 0) radom
FROM
    country
LIMIT
     10;

 * mysql+mysqlconnector://root:***@localhost:3306/world
10 rows affected.

[('309468',),
 ('711949',),
 ('631345',),
 ('020874',),
 ('210339',),
 ('989070',),
 ('314333',),
 ('604457',),
 ('079287',),
 ('583064',)]

## 日期函数

<img src="./image/日期函数.jpg" width="70%">

### 1. 建国时长统计

In [73]:
%%sql
SELECT
    Name 国家,
    IndepYear 独立年份,  
    YEAR(CURDATE()) - IndepYear 建国时长
FROM
    country
WHERE
    IndepYear IS NOT NULL 
    AND
    Population > 100000000
ORDER BY
    Population DESC

 * mysql+mysqlconnector://root:***@localhost:3306/world
10 rows affected.

[('China', -1523, 3547),
 ('India', 1947, 77),
 ('United States', 1776, 248),
 ('Indonesia', 1945, 79),
 ('Brazil', 1822, 202),
 ('Pakistan', 1947, 77),
 ('Russian Federation', 1991, 33),
 ('Bangladesh', 1971, 53),
 ('Japan', -660, 2684),
 ('Nigeria', 1960, 64)]

## 流程控制函数

<img src="./image/流程控制函数.jpg" width="70%">

### 1. 判断人口前十国家中是否在亚洲

In [80]:
%%sql
SELECT
    Name 国家,
    Continent 洲,
    ROUND(Population/100000000, 2) '人口(亿)',
    IF(Continent != 'Asia', 'NO', 'YES') '亚洲国家'
FROM
    country
ORDER BY   
    Population DESC
LIMIT
    10;

 * mysql+mysqlconnector://root:***@localhost:3306/world
10 rows affected.

[('China', 'Asia', Decimal('12.78'), 'YES'),
 ('India', 'Asia', Decimal('10.14'), 'YES'),
 ('United States', 'North America', Decimal('2.78'), 'NO'),
 ('Indonesia', 'Asia', Decimal('2.12'), 'YES'),
 ('Brazil', 'South America', Decimal('1.70'), 'NO'),
 ('Pakistan', 'Asia', Decimal('1.56'), 'YES'),
 ('Russian Federation', 'Europe', Decimal('1.47'), 'NO'),
 ('Bangladesh', 'Asia', Decimal('1.29'), 'YES'),
 ('Japan', 'Asia', Decimal('1.27'), 'YES'),
 ('Nigeria', 'Africa', Decimal('1.12'), 'NO')]